# weather = input("Какая сегодня погода: 1 - хорошая/2 - плохая: ")
# tickets = input("Есть ли билеты: 1 - да/2 - нет: ")
# table = input("Есть ли свободный столик: 1 - да/2 - нет: ")
#
# if weather == '1':
#     print('Идем гулять!')
# elif tickets == '1':
#     print('Идем в кино!')
# elif table == '1':
#     print('Идем в ресторан!')
# else:
#     print('Вечер пиццы и настолок!')


weather = input("Какая сегодня погода: 1 - хорошая/2 - для кино/3 - для ресторана/0 - для посиделок дома: ")

if weather == '1':
    print('Идем гулять!')
elif weather == '1':
    print('Идем в кино!')
elif weather == '1':
    print('Идем в ресторан!')
else:
    print('Вечер пиццы и настолок!')

