# print(11111111)
# print(11_111_111)
#
# print(+11111111)
# print(+11_111_111)
#
# print(-11111111)
# print(-11_111_111)


# из восьмеричной/шестнадцатеричной в десятичною
print(0o123)
print(0x123ab)

print(int('123', 8))
print(int('123AB', 16))
print()

# из десятичной в восьмеричную/шестнадцатеричную
print("Восьмеричное представление числа 1234 >>", format(1234, 'o'))
print("Шестнадцатеричное представление числа 1234 >>", format(1234, 'x'))
print()

# e - exponent (степень)
print(3e8)
print(3e100)
print(3e-4)
print(3e-5)